<?php

use yii\db\Migration;

/**
 * Вставка тестовых данных.
 * FIXME: Данную миграцию, в случае разворачивания боевого приложения - удалить
 */
class m180412_134052_insert_test_data extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $sql = "
        INSERT INTO `f1_claim` (`id`, `reg_date`, `doc_type`, `doc_num_pb`, `claim_id_pb`, `claim_data`, `current_status`, `insert_date`, `change_date`, `loss_id_cis`) VALUES
        (1, '2018-03-22 00:00:00', 'HI', 'DNH0HI-181L5X3', 'Z182MPB70000BN', '{\"idAcc\":\"Z182MPB70000BN\",\"statusAcc\":104,\"dateReg\":\"2018-03-22\",\"dateEvent\":\"2018-03-19T00:00:00.000\",\"locationEvent\":\"Днепр\",\"descriptionEvent\":\"Острый назофаренгит, острый двухсоронний сальпингоотит. Телефон клиента:+380679842458\",\"phoneClient\":\"+380679842458\",\"ira_Sum\":5000,\"disease\":[{\"disease\":\"Рішення прийнято.\"},{\"disease\":\"Рішення прийнято.\"}],\"declines\":[],\"action\":[{\"actionType\":\"k\",\"description\":null,\"dateStart\":\"2018-03-22T15:32:48.000\",\"dateEnd\":\"2018-03-22T00:00:00.000\",\"flHandle\":null}],\"dealReport\":{\"ref\":\"DNH0HI-181L5X3\",\"reqId\":\"Z181LPB30005KY\",\"statusDeal\":92,\"reqDate\":\"2018-02-21T19:35:53.000\",\"dateStart\":\"2018-02-22T00:00:00.000\",\"dateEnd\":\"2019-02-21T00:00:00.000\",\"insurSumm\":100000,\"payType\":\"p\",\"tariff\":1.2,\"insurProg\":\"V3\",\"payment\":1200,\"insurant\":{\"id\":\"2892800014\",\"fio\":\"Назаренко Денис Вікторович\",\"adr\":\"49127 ДНІПРОПЕТРОВСЬКА ОБЛ. М. ДНІПРО ВУЛ. АГНІЇ БАРТО, 12, 39\",\"pSer\":\"АЕ\",\"pNum\":\"004706\",\"pWho\":\"САМАР РОДГУУМВД УКР ДН-ВСК\",\"pDate\":\"1996-03-15\",\"bornDat\":\"1979-03-15\"},\"beneficiary\":{\"id\":\"2892800014\",\"fio\":\"Назаренко Денис Вікторович\",\"adr\":\"49127 ДНІПРОПЕТРОВСЬКА ОБЛ. М. ДНІПРО ВУЛ. АГНІЇ БАРТО, 12, 39\",\"pSer\":\"АЕ\",\"pNum\":\"004706\",\"pWho\":\"САМАР РОДГУУМВД УКР ДН-ВСК\",\"pDate\":\"1996-03-15\",\"bornDat\":\"1979-03-15\"},\"object\":[{\"name\":\"От несчастного случая\",\"insurSumm\":100000,\"ccySumm\":\"UAH\",\"price\":100000,\"ccyPrice\":\"UAH\",\"rate\":1.2,\"person\":{\"fio\":\"НАЗАРЕНКО НИКА ДЕНИСОВНА\",\"bornDat\":\"2014-07-20\"}}]}}', 4, '2018-03-22 15:00:21', NULL, NULL),
        (2, '2018-01-26 00:00:00', 'RT', 'DNH0RT-180Q2AS', 'Z180UPB700008Q', '{\"idAcc\":\"Z180UPB700008Q\",\"statusAcc\":102,\"dateReg\":\"2018-01-26\",\"dateEvent\":\"2018-01-26T00:00:00.000\",\"locationEvent\":\" \",\"descriptionEvent\":\"sddfdsf\",\"phoneClient\":\"+380973652744\",\"ira_Sum\":0,\"disease\":[],\"declines\":[],\"action\":[],\"dealReport\":{\"ref\":\"DNH0RT-180Q2AS\",\"reqId\":\"Z180QPB300026H\",\"statusDeal\":92,\"reqDate\":\"2018-01-26T12:11:18.000\",\"dateStart\":\"2018-01-26\",\"dateEnd\":\"2018-02-14\",\"insurSumm\":111.7,\"payType\":\"s\",\"tariff\":11,\"insurProg\":\"TR\",\"payment\":12.29,\"insurant\":{\"id\":\"3401912052\",\"fio\":\"Сторчак Андрій Олександрович\",\"adr\":\"26543 КІРОВОГРАДСЬКА ОБЛ. ГОЛОВАНІВСЬКИЙ Р-Н. С. МОЛДОВКА ВУЛ. ГАЗЕТИ ПРАВДА, 14\",\"pSer\":\"ЕВ\",\"pNum\":\"225635\",\"pWho\":\"ГОЛОВАНЕВСКИМ РО УМВД УКР В КИРОВОГРАДСКОЙ ОБЛ\",\"pDate\":\"2009-03-14\",\"bornDat\":\"1993-02-20\"},\"beneficiary\":{\"id\":\"3401912052\",\"fio\":\"Сторчак Андрій Олександрович\",\"adr\":\"26543 КІРОВОГРАДСЬКА ОБЛ. ГОЛОВАНІВСЬКИЙ Р-Н. С. МОЛДОВКА ВУЛ. ГАЗЕТИ ПРАВДА, 14\",\"pSer\":\"ЕВ\",\"pNum\":\"225635\",\"pWho\":\"ГОЛОВАНЕВСКИМ РО УМВД УКР В КИРОВОГРАДСКОЙ ОБЛ\",\"pDate\":\"2009-03-14\",\"bornDat\":\"1993-02-20\"},\"object\":[{\"name\":\"Cтрахування залізничних квитків\",\"insurSumm\":111.7,\"ccySumm\":\"UAH\",\"price\":10000,\"ccyPrice\":\"UAH\",\"rate\":11,\"ticket\":{\"flight\":\"046Д\",\"placeStart\":\"ХАРКІВ-ПАС\",\"timeStart\":\"2018-02-14T12:28:00.000\",\"placeTo\":\"КИЇВ-ПАСАЖИРСЬКИЙ\",\"section\":\"11\",\"seat\":\"15\",\"numTicket\":\"000B3DD0-37B5E881-0001\"}}]}}', 4, '2018-02-08 16:54:41', NULL, NULL),
        (3, '2018-02-19 00:00:00', 'SKM', 'ABH0SKM-181J3B7', 'Z181JPB700009I', '{\"idAcc\":\"Z181JPB700009I\",\"statusAcc\":102,\"dateReg\":\"2018-02-19\",\"dateEvent\":\"2018-02-19T00:00:00.000\",\"locationEvent\":\"Тестовая, отклонить\",\"descriptionEvent\":\"Тестовая, отклонить\",\"ira_Sum\":6000,\"disease\":[],\"declines\":[],\"action\":[],\"dealReport\":{\"ref\":\"ABH0SKM-181J3B7\",\"reqId\":\"Z181JPB300034Y\",\"statusDeal\":91,\"reqDate\":\"2018-02-19T14:26:42.000\",\"dateStart\":\"2018-02-20T00:00:00.000\",\"dateEnd\":\"2019-02-19T00:00:00.000\",\"insurSumm\":50000,\"payType\":\"p\",\"tariff\":0.696,\"insurProg\":\"SK\",\"payment\":348,\"insurant\":{\"id\":\"3278801279\",\"fio\":\"Ступка Денис Валерійович\",\"adr\":\"49000 ДНІПРОПЕТРОВСЬКА ОБЛ. М. ДНІПРО ПРОСП. ГАГАРІНА, 28, 1, 524\",\"pSer\":\"АН\",\"pNum\":\"464149\",\"pWho\":\"ПОКРОВСКИМ РО УМВД УКРАИНЫ В ДНЕПРОПЕТРОВСКОЙ ОБЛ\",\"pDate\":\"2005-12-09\",\"bornDat\":\"1989-10-08\"},\"beneficiary\":{\"id\":\"3278801279\",\"fio\":\"Ступка Денис Валерійович\",\"adr\":\"49000 ДНІПРОПЕТРОВСЬКА ОБЛ. М. ДНІПРО ПРОСП. ГАГАРІНА, 28, 1, 524\",\"pSer\":\"АН\",\"pNum\":\"464149\",\"pWho\":\"ПОКРОВСКИМ РО УМВД УКРАИНЫ В ДНЕПРОПЕТРОВСКОЙ ОБЛ\",\"pDate\":\"2005-12-09\",\"bornDat\":\"1989-10-08\"},\"object\":[{\"name\":\"Финансовых потерь\",\"insurSumm\":50000,\"ccySumm\":\"UAH\",\"price\":50000,\"ccyPrice\":\"UAH\",\"rate\":0.696,\"person\":{\"id\":\"3278801279\",\"fio\":\"Ступка Денис Валерійович\",\"adr\":\"49000 ДНІПРОПЕТРОВСЬКА ОБЛ. М. ДНІПРО ПРОСП. ГАГАРІНА, 28, 1, 524\",\"pSer\":\"АН\",\"pNum\":\"464149\",\"pWho\":\"ПОКРОВСКИМ РО УМВД УКРАИНЫ В ДНЕПРОПЕТРОВСКОЙ ОБЛ\",\"pDate\":\"2005-12-09\",\"bornDat\":\"1989-10-08\"}}]}}', 4, '2018-02-20 09:46:39', NULL, NULL),
        (4, '2018-01-02 00:00:00', 'NBR', 'DNH0NBR-17BK3XI', 'Z1802PB700008W', '{\"idAcc\":\"Z1802PB700008W\",\"statusAcc\":7,\"dateReg\":\"2018-01-02\",\"dateEvent\":\"2018-01-01T00:00:00.000\",\"locationEvent\":\"Львів\",\"descriptionEvent\":\"мокра стіна. Телефон клієнта:+380667126624\",\"phoneClient\":\"+380667126624\",\"ira_Sum\":0,\"disease\":[],\"declines\":[],\"action\":[{\"actionType\":\"k\",\"description\":null,\"dateStart\":\"2018-01-26T10:07:32.000\",\"dateEnd\":\"2018-01-26T09:30:00.000\",\"flHandle\":null}],\"dealReport\":{\"ref\":\"DNH0NBR-17BK3XI\",\"reqId\":\"Z17BKPB30003PK\",\"statusDeal\":92,\"reqDate\":\"2017-12-20T21:49:00.000\",\"dateStart\":\"2017-12-21\",\"dateEnd\":\"2018-12-20\",\"insurSumm\":50000,\"payType\":\"p\",\"tariff\":0.48,\"insurProg\":\"N2\",\"payment\":240,\"insurant\":{\"id\":\"2828904838\",\"fio\":\"Онуфрик Ігор Петрович\",\"adr\":\"79057 ЛЬВІВСЬКА ОБЛ. М. ЛЬВІВ ВУЛ. ГІПСОВА, 62, 10\",\"pSer\":\"КВ\",\"pNum\":\"309470\",\"pWho\":\"ЗАЛІЗНИЧНИМ РВ УМВСУ У ЛЬВІВСЬКІЙ ОБЛ.\",\"pDate\":\"1999-11-18\",\"bornDat\":\"1977-06-14\"},\"beneficiary\":{\"id\":\"2828904838\",\"fio\":\"Онуфрик Ігор Петрович\",\"adr\":\"79057 ЛЬВІВСЬКА ОБЛ. М. ЛЬВІВ ВУЛ. ГІПСОВА, 62, 10\",\"pSer\":\"КВ\",\"pNum\":\"309470\",\"pWho\":\"ЗАЛІЗНИЧНИМ РВ УМВСУ У ЛЬВІВСЬКІЙ ОБЛ.\",\"pDate\":\"1999-11-18\",\"bornDat\":\"1977-06-14\"},\"object\":[{\"name\":\"Недвижимости\",\"insurSumm\":30000,\"ccySumm\":\"UAH\",\"price\":30000,\"ccyPrice\":\"UAH\",\"rate\":0.672,\"estate\":{\"adr\":\"Львівська обл.,  м. Львів, вулиця Драгана буд. 9 к.  кв. 126\"}},{\"name\":\"Имуществу 3х лиц\",\"insurSumm\":10000,\"ccySumm\":\"UAH\",\"price\":10000,\"ccyPrice\":\"UAH\",\"rate\":0.192},{\"name\":\"Здоровью  и жизни 3х лиц\",\"insurSumm\":10000,\"ccySumm\":\"UAH\",\"price\":10000,\"ccyPrice\":\"UAH\",\"rate\":0.192}]}}', 4, '2018-02-08 16:54:36', NULL, NULL);
        ";

        $this->execute($sql);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m180412_134052_insert_test_data cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m180412_134052_insert_test_data cannot be reverted.\n";

        return false;
    }
    */
}
